// 主体分析数据
export const ztfxData = {
  // 市场主体类型分析
  data1: [
    {
      name: '采购人',
      value: 162
    },
    {
      name: '代理机构',
      value: 258
    },
    {
      name: '供应商',
      value: 735
    }
  ],
  // 供应商地区占比分析 y是显示数值 h是饼的高度
  data2: [
    { name: '省内企业', y: 80, h: 40 },
    { name: '省外企业', y: 120, h: 20 },
  ],
  // 供应商活跃度排行 修改按照高到低排列修改
  data3: [
    {
      name: '贵州移动信息科技有限公司',
      nums: '469'
    },
    {
      name: '上海申银机械（集团）有限公司',
      nums: '400'
    },
    {
      name: '广西北投信创科技投资集团有限公司',
      nums: '357'
    },
    {
      name: '山东埃尔派粉体科技有限公司',
      nums: '302'
    }
  ],
  // 采购人关注度排行
  data4: [
    ['N0.1', '<span style="color:#88EAFF;">贵阳城发能源产业发展有限公司</span>', '276家'],
    ['N0.2', '<span style="color:#88EAFF;">六盘水市钟山水务投资有限责任公司</span>', '233家'],
    ['N0.3', '<span style="color:#88EAFF;">贵州振华义龙新材料有限公司</span>', '198家'],
    ['N0.4', '<span style="color:#88EAFF;">贵州筑城恒创建设工程有限公司</span>', '160家'],
    ['N0.5', '<span style="color:#88EAFF;">上海申银机械（集团）有限公司</span>', '126家'],
    ['N0.6', '<span style="color:#88EAFF;">贵州黔诚机电设备工程有限公司</span>', '98家']
  ],
  // 代理活跃度排行
  data5: [
    ['1', '贵州鹏业国际机电设备招标有限公司', '796'],
    ['2', '贵州红葫芦工程项目管理咨询有限公司', '643'],
    ['3', '贵州黔通招标代理有限公司', '345'],
    ['4', '鹏业云通建设咨询有限公司', '240'],
    ['5', '鹏业云通建设咨询有限公司', '240'],
  ],
  // 主体入驻情况分析 name是主体名称 num1是数量 num2是本月新增数量
  data6: [
    {
      name: '个人用户',
      num1: '7923',
      num2: '4'
    },
    {
      name: '采购人',
      num1: '14862',
      num2: '23'
    },
    {
      name: '代理机构',
      num1: '1986',
      num2: '6'
    },
    {
      name: '供应商',
      num1: '914',
      num2: '12'
    }
  ],
  // 企业占比分析 第一项是中小微企业占比 第二项是高新企业占比
  data7: [42, 70]
}
